## Notebook for exporatory data analysis of Per Scholas Data

In [3]:
import os
import pandas as pd

In [2]:
os.getcwd()

'/home/kt12/repos/keepint'

In [23]:
a = pd.read_csv('per_scholas_data.csv', skiprows=range(1,2))
b = pd.read_csv('per_scholas_data2.csv')
c = pd.read_csv('per_scholas_data3.csv', skiprows=range(1,2))

In [24]:
a.head()

,Record ID,Workflow Status,Cycle,Placed,Start Date,Retained (Months),First Post Training Wage,Current Wage,Wage Gain %,Alumni Status,Career Coach,Meeting & Outreach Name,Meeting/ Outreach Date,Meeting Type,Outreach Type,# of Outreaches,Total # of Two-Way Contacts
0,CON-38109,Graduated,2014-15-NY,1,5/2/2014,5.0,15.00,NaN,NaN,STEP Program,Diana,M&O-2238,4/26/2016,Call,Quarterly Meeting - Unemployed,1,1
1,CON-47061,Graduated,2015-07-NY,1,2/10/2016,12.0,9.75,11.25,15%,Initial Placement,Diana,M&O-2237,4/22/2016,Call,Quarterly Meeting - Employed,4,5
2,CON-49375,Graduated,2016-06-NY,1,6/8/2015,16.0,23.00,45.67,99%,Re-placement,Diana,M&O-2235,4/21/2016,Call,Quarterly Meeting - Employed,1,1
3,CON-43833,Graduated,2015-15-NY,1,8/4/2014,13.0,15.00,NaN,NaN,Initial Placement,Diana,M&O-2251,6/27/2016,Call,Quarterly Meeting - Unemployed,0,1
4,CON-26658,Graduated,2016-06-NY,1,3/25/2015,18.0,21.63,26.44,22%,Placement Captured,Diana,M&O-2240,4/27/2016,Call,Quarterly Meeting - Employed,2,3

In [25]:
b.head()

,Record ID,Event/Workshop Date,# of New Hire Workshops,Alumni Event/Workshop Name
0,CON-40152,10/12/2016,1,New Hire Workshop
1,CON-25958,10/12/2016,1,New Hire Workshop
2,CON-42453,10/12/2016,1,New Hire Workshop
3,CON-41234,10/12/2016,1,New Hire Workshop
4,CON-32094,10/12/2016,1,New Hire Workshop

In [26]:
c.head()

,Record ID,Cycle,Alumni Class: Cycle Name,Certification Name,Date of Test,Status
0,CON-7354,2013-14-NY,SEC-16-002,CompTIA Security+,9/30/2016,Passed
1,CON-51341,2014-13-NY,SEC-16-002,CompTIA Security+,NaN,Not Reported
2,CON-47819,2015-16-NY,SEC-16-002,CompTIA Security+,10/19/2016,No Show
3,CON-45524,2014-13-NY,SEC-16-002,CompTIA Security+,10/19/2016,No Show
4,CON-46295,2015-16-NY,SEC-16-002,CompTIA Security+,NaN,Not Reported

In [33]:
a.describe()

,Placed,Retained (Months),First Post Training Wage,Current Wage,# of Outreaches,Total # of Two-Way Contacts
count,247.000000,242.000000,242.000000,95.000000,247.000000,247.000000
mean,0.979757,10.326446,16.402149,20.670737,1.291498,1.587045
std,0.141116,5.681451,6.052509,8.354926,0.885778,2.925830
min,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,1.000000,6.000000,13.000000,15.510000,1.000000,1.000000
50%,1.000000,11.000000,16.000000,20.000000,1.000000,1.000000
75%,1.000000,14.000000,20.000000,25.000000,1.000000,1.000000
max,1.000000,32.000000,38.000000,45.670000,5.000000,44.000000

In [34]:
b.describe()

       # of New Hire Workshops
count                     50.0
mean                       1.0
std                        0.0
min                        1.0
25%                        1.0
50%                        1.0
75%                        1.0
max                        1.0

In [35]:
c.describe()

,Record ID,Cycle,Alumni Class: Cycle Name,Certification Name,Date of Test,Status
count,106,106,106,106,84,106
unique,102,44,8,4,41,5
top,CON-47819,2016-06-NY,BC-16-002,CompTIA Network+,5/2/2016,Failed
freq,2,11,25,52,10,40

In [36]:
a.shape

(247, 17)

In [37]:
b.shape

(50, 4)

In [38]:
c.shape

(106, 6)

In [27]:
merged_df = a.merge(b,on='Record ID').merge(c,on='Record ID')

In [28]:
merged_df.head()

,Record ID,Workflow Status,Cycle_x,Placed,Start Date,Retained (Months),First Post Training Wage,Current Wage,Wage Gain %,Alumni Status,...,# of Outreaches,Total # of Two-Way Contacts,Event/Workshop Date,# of New Hire Workshops,Alumni Event/Workshop Name,Cycle_y,Alumni Class: Cycle Name,Certification Name,Date of Test,Status
0,CON-43833,Graduated,2015-15-NY,1,8/4/2014,13.0,15.00,NaN,NaN,Initial Placement,...,0,1,3/16/2016,1,New Hire Workshop,2011-18-NY,Net BC-16-001,CompTIA Network+,NaN,Not Reported
1,CON-32546,Graduated,2014-20-NY,1,1/26/2014,29.0,22.00,39.62,80%,Re-placement,...,4,5,3/16/2016,1,New Hire Workshop,2014-07-NY,SEC-16-003,CompTIA Security+,9/13/2016,Passed
2,CON-37086,Graduated,2016-07-NY,1,2/2/2015,15.0,35.00,38.46,10%,Re-placement,...,2,2,8/17/2016,1,New Hire Workshop,2015-13-NY,SEC-16-003,CompTIA Security+,8/16/2016,Passed
3,CON-37086,Graduated,2015-07-NY,1,3/7/2016,12.0,16.83,NaN,NaN,Initial Placement,...,1,1,8/17/2016,1,New Hire Workshop,2015-13-NY,SEC-16-003,CompTIA Security+,8/16/2016,Passed
4,CON-46466,Graduated,2014-15-NY,1,7/3/2015,12.0,17.50,NaN,NaN,Initial Placement,...,1,1,3/16/2016,1,New Hire Workshop,2014-14-NY,Sec-16-004,CompTIA Security+,9/17/2016,Failed

In [40]:
merged_df.describe()

,Placed,Retained (Months),First Post Training Wage,Current Wage,# of Outreaches,Total # of Two-Way Contacts,# of New Hire Workshops
count,9.0,9.000000,9.000000,4.000000,9.000000,9.000000,9.0
mean,1.0,13.777778,18.984444,28.677500,1.777778,2.000000,1.0
std,0.0,6.220486,6.840391,12.277036,1.641476,1.732051,0.0
min,1.0,7.000000,11.000000,15.000000,0.000000,1.000000,1.0
25%,1.0,12.000000,15.000000,19.972500,1.000000,1.000000,1.0
50%,1.0,13.000000,17.500000,30.045000,1.000000,1.000000,1.0
75%,1.0,14.000000,21.030000,38.750000,2.000000,2.000000,1.0
max,1.0,29.000000,35.000000,39.620000,5.000000,5.000000,1.0

In [41]:
merged_df.shape

(9, 25)